Repository: vpchc/ValleyProHealth_iOS
Catalog: ValleyProHealth/*.lproj/Localizable.strings
Languages: es

source: You can find a schedule for the MSBHC in the tracker section of this app.
es: Usted puede encontrar un calendario para la MSBHC en la sección de seguimiento de esta aplicación.

source: Your device could not send e-mail. Please check e-mail configuration and try again.
es: Su dispositivo no podría enviar un correo electrónico. Por favor, compruebe la configuración del correo electrónico y vuelva a intentarlo.

source: •Acute Illness
es: •Enfermedad Agudo

source: •CDL Exam
es: •Examen CDL

source: •Child/Adolescent counseling
es: •Niño / orientación a los adolescentes

source: •Chronic Disease Care
es: •Atención de enfermedades crónicas

source: •Colposcopy
es: •Colposcopia

source: •Crisis counseling
es: •La consejería de crisis

source: •Family Planning
es: •Planificación familiar

source: •Family counseling
es: •Asesoramiento Familiar

source: •Geriatric Care
es: •Atención Geriátrica

source: •Immunizations
es: •Inmunizaciónes

source: •Labor and Delivery
es: •Trabajo y entrega

source: •Laboratory Services
es: •Servicios de laboratorio

source: •Men's Health
es: •Salud de los hombres

source: •Minor Surgery
es: •Cirugía menor

source: •Nutritional Counseling
es: •Asesoría nutricional

source: •Physical Exam
es: •Examen físico

source: •Pregnancy Care
es: •Cuidados durante el embarazo

source: •Preventive Care
es: •Cuidado preventivo

source: •Preventive and restorative services
es: •Los servicios preventivos y de restauración

source: •Psychiatry
es: •Psiquiatría

source: •Testing/Assessment(upon referral)
es: •Exámenes / Evaluación (tras la recomendación)

source: •Vasectomy
es: •La vasectomía

source: •Well Child Visits
es: •A las visitas del niño sano

source: •Women's Health
es: •La salud de la mujer
