Repository: vpchc/ValleyProHealth_iOS
Catalog: ValleyProHealth/*.lproj/Localizable.strings
Languages: es

source: -Are patient advocates and your navigator through the healthcare system
es: Son defensores de los pacientes y su navegador a través del sistema de salud

source: -Educate patients on preventive healthcare behaviors
es: -Educar a los pacientes sobre los comportamientos de salud preventivos

source: -Help patients find necessities like food, clothes, and toiletries
es: -Ayudan a los pacientes a encontrar artículos de primera necesidad como alimentos, ropa y artículos de higiene

source: -Provide assistance navigating the Insurance Marketplace, Healthy Indiana Plan, and Medicaid applications
es: -Proporcionar asistencia navegación por el mercado de seguros, el Plan de Salud de Indiana, y las solicitudes de Medicaid

source: -Work with a Care Coordinators and learn how to manage chronic health concerns, and take steps to improve your health Care Coordinators and learn how to manage chronic health concerns, and take steps to improve your health Care Coordinators and learn how to manage chronic health concerns, and take steps to improve your health Care Coordinators and learn how to manage chronic health concerns, and take steps to improve your health
es: -Trabajar con un Coordinador de Atención y aprender cómo manejar los problemas de salud crónicos, y tomar medidas para mejorar su salud

source: 340B Program: This program helps cover the cost of many precscription medications. Based on your family income and size determines how much you have to pay for your medications. Application for the sliding fee scale is required for this program. If you qualify, medications may be free or low cost.
es: Programa 340B: Este programa ayuda a cubrir el costo de muchos medicamentos de prescripción. Sobre la base de sus ingresos y tamaño de la familia determina cuánto tiene que pagar por sus medicamentos. Se requiere la aplicación de la Sliding Fee Scale para este programa. Si reúne los requisitos, los medicamentos pueden ser gratuitos o de bajo costo.

source: Additional programs are also available such as discount drug cards and the Freestyle Promise Program.
es: Los programas adicionales están también disponibles como tarjetas de descuento en medicamentos y el Programa Promise Freestyle.

source: Are you accepting new patients?
es: Estás aceptando nuevos pacientes?

source: Behavioral Health
es: Salud del Comportamiento

source: Billing/Insurance
es: Facturación/Seguros

source: Calling Bloomingdale Location...
es: Llamar a Bloomingdale Localización...

source: Calling Cayuga Location...
es: Llamar a Cayuga Localización...

source: Calling Clinton Location...
es: Llamar a Clinton Localización...

source: Calling Crawfordsville Location...
es: Llamar a Crawfordsville Localización...

source: Calling MSBHC Location...
es: Llamar a MSBHC Localización...

source: Calling Terre Haute Location...
es: Llamar a Terre Haute Localización...

source: Can I be seen by a provider even if I do not have health insurance?
es: ¿Puedo ser visto por un proveedor, incluso si no tengo seguro de salud?

source: Can I make an appointment with a Behavioral Health counselor?
es: ¿Puedo hacer una cita con un consejero de salud del comportamiento?

source: Can Valley Professionals help me enroll in health insurance coverage?
es: Valley Professionals puede ayudar a inscribirme en la cobertura del seguro de salud?

source: Can anyone else (i.e. grandparent, family friend, or childcare provider) bring my child to his or her appointment?
es: ¿Puede alguien más (es decir, abuelo, amigo de la familia, o proveedor de cuidado de niños) llevar a mi niños a su cita?

source: Check here for latest news and information concerning Valley Professionals Community Health Center.
es: Consulte aquí las últimas noticias e información en relación con el Valley Professionals Community Health Center.

source: Check out our Patient Portal where you can schedule appointments, email your provider, request refills and more! See one of our receptionists to enroll for free now!
es: Visita nuestra Portal del Paciente donde se puede programar citas , enviar por correo electrónico su proveedor, recargas de petición y más ! Ver uno de nuestros recepcionistas para inscribirse de forma gratuita ahora!

source: Clinic Hours
es: Horario de la clínica

source: Closed
es: Cerrado

source: Closing Soon
es: Próximas a concluir

source: Contact Info
es: Datos de contacto

source: Could Not Send Email
es: No se pudo enviar por correo electrónico

source: Diabetic Support Group
es: Grupo de apoyo para diabéticos

source: Do I have to be a patient to take part in the Diabetic Support Group?
es: ¿Tengo que ser un paciente para participar en el grupo de apoyo para diabéticos?

source: Do I have to be a patient to use the After-Hours Clinic?
es: ¿Tengo que ser un paciente a utilizar la clínica fuera de horario?

source: Do I need an appointment for the After-Hours clinic?
es: ¿Necesito una cita para la clínica fuera de horario?

source: Do you need resources in your community? Do you need help find health coverage for your family? Contact one of our CHWs!
es: ¿Necesita recursos en su comunidad? ¿Necesita ayuda para encontrar la cobertura de salud para su familia? Póngase en contacto con uno de nuestros CHWs!

source: Do you offer prenatal services?
es: Es lo que ofrece servicios de atención prenatal?

source: Does it count against my child's attendance when he or she is seen by the MSBHC?
es: ¿Se cuenta en contra de la asistencia de mi hijo cuando él o ella es vista por el MSBHC?

source: Does the MSBHC visit my school?
es: ¿Visita la MSBHC mi escuela?

source: Does the Mobile School-Based Health Center offer school physical examinations?
es: Hace los exámenes físicas escolares móvil Centro de Salud ofrece la escuela?

source: Downloading MSBHC Schedule…
es: Descarga de Horario de Buses…

source: Drug Companies: Many of commonly prescribed drugs can be obtained through drug companies at no cost or low cost. Our Community Health Workers can assist in these applications.
es: Las compañías farmacéuticas: Muchos de los medicamentos comúnmente recetados pueden obtenerse en las compañías farmacéuticas, sin costo o de bajo costo. Nuestros trabajadores de salud comunitaria pueden ayudar en estas aplicaciones.

source: English
es: Inglés

source: For all inquiries regarding billing, please contact our Billing Department at (765) 828–1000.
es: Para todas las consultas relativas a la facturación, por favor, póngase en contacto con nuestro Departamento de Facturación al (765) 828-1000.

source: For your first appointment, you should bring your completed new patient paperwork, along with your driver's license and insurance information. When you arrive, the front office will make a copy of your medical insurance card and verify that your account information is up-to-date. A nurse will complete your medical history after you have been checked in, but please bring any relevant medical information, including all names and dosages of prescriptions and over-the-counter medications that you are currently taking.
es: Para su primera cita, usted debe traer su nueva paciente papeleo completado, junto con la licencia y el seguro de la información de su conductor. Al llegar, la oficina hará una copia de su tarjeta de seguro médico y verificar que la información de su cuenta está al día. Una enfermera completar su historial médico después de haber sido registrado, pero por favor traiga toda la información médica relevante, incluyendo todos los nombres y las dosis de medicamentos recetados y over-the-counter medicamentos que está tomando actualmente.

source: Get Directions
es: Obtener las direcciones

source: Good Rx: The website goodrx.com has comparison shopping on prescriptions and offer many good coupons.
es: Bueno Rx: El sitio web tiene goodrx.com comparación de compras en las recetas y ofrecen muchos buenos cupones.

source: How do I know when the MSBHC will be at my school?
es: ¿Cómo sé cuando la MSBHC estará en mi escuela?

source: How long will it take for me to receive my prescription refill after I have submitted a request?
es: ¿Cuánto tiempo tomará para que puedo recibir mi receta de recarga después de haber presentado una solicitud?

source: How soon will I be able to schedule my first appointment?
es: ¿Qué tan pronto voy a ser capaz de programar mi primera cita?

source: If patients are not covered by any type of medical insurance for their medical needs, a sliding fee scale is available for patients to receive a discounted rate. Discounts available are based on patient family size and income in accordance with the most recent U.S. Department of Health and Human Services Federal Poverty Guidelines.
es: Si los pacientes no están cubiertos por ningún tipo de seguro médico para sus necesidades médicas, una escala móvil está disponible para los pacientes que reciben un descuento. Descuentos disponibles se basan en el tamaño de la familia del paciente y de resultados de acuerdo con el más reciente del Departamento de Salud y Servicios Humanos de EE.UU. nivel federal de pobreza.

source: If you are an established patient, speak with your Primary Care Provider about referring you to a Valley Professionals Behavioral Health counselor.
es: Si usted es un paciente establecido, hable con su médico de cabecera acerca de usted en referencia a un Valley Professionals consejero de Salud del Comportamiento.

source: If you are not able to make an appointment, please call to let us know.
es: Si usted no es capaz de hacer una cita, por favor llame para informarnos.

source: If you unable to pay your bill, feel free to contact our Billing Department at (765) 828–1000 to set up a payment plan that works for you.
es: Si usted no puede pagar su factura, no dude en ponerse en contacto con nuestro Departamento de Facturación al (765) 828-1000 para establecer un plan de pago que funcione para usted.

source: In order to qualify for the sliding fee scale at VPCHC, patients and their families must have a combined income that falls within the U.S. Federal Poverty Guidelines.
es: Con el fin de calificar para la Sliding Fee Scale en VPCHC, los pacientes y sus familias deben tener un ingreso combinado que cae dentro de las pautas de pobreza federales de Estados Unidos.

source: Is Valley Professionals hiring?
es: Se contratación de Valley Professionals?

source: Primary Care
es: Atención primaria

source: Miscellaneous
es: Diverso

source: New Patients
es: Nuevos Pacientes

source: New patient appointments can be scheduled as soon as two weeks. In the mean time we will send you paperwork to be completed and brought in on the day of your appointment.
es: Nuevas citas de los pacientes se pueden programar tan pronto como dos semanas. Por el momento, le enviaremos el papeleo para ser completado y puesto en el día de su cita

source: No Preference
es: Sin preferencias

source: No changes to save
es: No hay cambios para ahorrar

source: No, After-Hours office visits are on a first-come, first-served basis.
es: No, fuera de horario de oficina es de visitas en un primer llegado, primer servido.

source: No, you are not required to be a current Valley Professionals patient to utilize the After-Hours services.
es: No, no es necesario ser una corriente Valley Professionals paciente a utilizar los servicios posteriores al cierre.

source: No, you do not have to register, make an appointment, or even be a patient of Valley Professionals to take part in the Diabetic Support Group.
es: No, usted no tiene que registrarse, haga una cita, o incluso ser un paciente de Valley Professionals a participar en el grupo de apoyo para diabéticos.

source: No, your child's visit to the MSBHC will not count against his or her attendance; moreover, if your child is sent home due to illness by an MSBHC provider, this absence would be certified excused.
es: No, la visita de su hijo al MSBHC no contará en contra de su asistencia; Por otra parte, si su hijo es enviado a casa debido a una enfermedad por un proveedor de MSBHC, sería certificado excusado su ausencia.

source: Open
es: Abierto

source: Opening Soon
es: Próxima apertura

source: Opening VPCHC Patient Portal webpage…
es: la Apertura de la página web VPCHC Portal del Paciente…

source: Patient Support
es: Portal del paciente

source: Please
es: Por favor

source: Prenatal services, as well as, Labor and Delivery are available at our Terre Haute clinic by referral. For more information, or to make an appointment, contact the Valley Professionals Community Health Center nearest you.
es: Los servicios prenatales, así como, la Sala de partos están disponibles en nuestra clínica Terre Haute por referencia. Para obtener más información, o para concertar una cita, póngase en contacto con el Valley Professionals Community Health Center más cercano.

source: Prescription Assistance
es: asistencia con los medicamentos

source: Prescription refill requests can take up to 48 hours once submitted.
es: pedidos de reposición de la prescripción pueden tardar hasta 48 horas una vez presentadas.

source: Refills can take up to 48 business hours to refill.
es: Recargas pueden tardar hasta 48 horas de oficina para rellenar

source: Restart App
es: Reiniciar App

source: Schedule Outdated
es: horario que ha sido superado

source: Select a category
es: Seleccione una categoría

source: Select a location
es: Seleccione una ubicación

source: Select a type of provider
es: Seleccionar un tipo de proveedor

source: Select a preferred location
es: Seleccione una ubicación preferida

source: Select an option
es: Seleccione una opcion

source: Services
es: Servicios

source: Spanish
es: Español

source: Students and Employees of a school hosting the Mobile Health Center may be seen. There are certain occasions during school breaks when the Mobile Health Center is open to the community. For more information, or to view the MSBHC's schedule, go to the tracker section of the app.
es: Los estudiantes y los empleados de una escuela que aloja el centro de salud móvil puede ser visto. Hay ciertas ocasiones, durante las vacaciones escolares, cuando el centro de salud móvil está abierto a la comunidad. Para obtener más información, o para ver el horario de la MSBHC, vaya a la sección de seguimiento de la aplicación.

source: The After-Hours clinic is for acute conditions, such as, fever, vomiting, congestion, sore throat, flu symptoms, cough, rash, earache, or other similar symptoms.
es: La clínica Después de las Horas es por afecciones agudas, tales como, fiebre, vómitos, congestión, dolor de garganta, síntomas de la gripe, tos, erupción cutánea, dolor de oído, u otros síntomas similares.

source: The After-Hours clinic takes place Monday through Thursday from 5:00pm to 8:00pm at our Clinton location only.
es: La clínica Abierto por la noche se lleva a cabo de lunes a jueves 17:00-20:00 a tan sólo nuestra ubicación Clinton.

source: The Health Insurance Portability and Accountability Act (HIPAA) prohibits us from sharing confidential patient health information without written authorization from the patient. If a patient would like to grant you permission to make an appointment for them or to access their medical records they must complete a Release of Information form, available in the forms section of this app.
es: La Ley de Responsabilidad y Portabilidad del Seguro de Salud (HIPAA) nos prohíbe el intercambio de información de salud del paciente confidencial sin autorización por escrito del paciente. Si un paciente le gustaría que le conceda permiso para hacer una cita para ellos o para tener acceso a sus registros médicos deben completar un formulario de divulgación de información, disponible en la sección de formularios de esta aplicación.

source: The MSBHC visits schools in the North Vermillion, South Vermillion, Southwest Parke, and North Central Parke school corporations.
es: El MSBHC visita escuelas en el Vermillion Norte, Sur Vermillion, Southwest Parke, y corporaciones escolares North Central Parke.

source: The sliding fee scale is based upon the current income of all family members, and the number of people in the household. An individual who is unemployed, has no income and is being supported by others must provide documentation showing that no federal income taxes have been filed, and the person supporting the patient must provide written and signed documentation that they are providing food and shelter for the patient.
es: La Sliding Fee Scale se basa en los ingresos corrientes de todos los miembros de la familia, y el número de personas en el hogar. Una persona que no tiene trabajo, no tiene ingresos y está siendo apoyado por los demás debe proporcionar documentación que demuestre que no hay impuestos federales sobre la renta se han presentado, y la persona de apoyo al paciente debe proporcionar documentación escrita y firmada que están proporcionando alimento y refugio para el paciente.

source: To apply for sliding fee scale, patients and their families must provide the following documents to verify gross income: Most recent tax filing with the IRS and/or W2's from employer(s), A copy of Social Security or Disability Award Letter(s) or unemployment statement(s),Pay stubs from all employerers for the last 30-day period, If unemployed, no income, and living with others, we require a signed and dated letter from the person providing support of the patient, Driver's license, Any other income that is direct deposited. For more information on sliding fee scale, visit the patient resources section of this app.
es: Para solicitar el programa de descuento, los pacientes y sus familias deben presentar la siguiente documentación para verificar los ingresos brutos: más reciente declaración de impuestos con el IRS y / o W2 de de empleador (s), una copia de la Seguridad Social o Discapacidad Premio Carta (s) o estado de cuenta (s) de desempleo, talones de pago de todas las employerers para el último período de 30 días, Si no está trabajando, sin ingresos, y vivir con los demás, se requiere una carta firmada y fechada por la persona que proporciona el apoyo del paciente, carné de conducir, cualquier otro ingreso que se deposita directa. Para obtener más información sobre la escala de tarifas, visite la sección de recursos del paciente de esta aplicación.

source: To enroll your child in MSBHC services, you must complete and submit the enrollment form found in the forms section. After you have done this, you may call the mobile unit and make an appointment, or your child can simply go to the school nurse and be referred.
es: Para inscribir a su hijo en los servicios MSBHC, debe completar y enviar el formulario de inscripción que se encuentra en la sección de formularios. Después de haber hecho esto, se puede llamar a la unidad móvil y hacer una cita, o su hijo puede ir simplemente a la enfermera de la escuela y ser referido.

source: To find out if one of our locations is accepting new patients please give us a call and we will be glad to assist you. The contact information for all of our clinics is available in the locations section of this app.
es: Para averiguar si uno de nuestros lugares está aceptando nuevos pacientes por favor, nos dan una llamada y estaremos encantados de ayudarle. La información de contacto para todas las clínicas está disponible en la sección ubicaciones de esta aplicación.

source: Valley Professionals has a 403(b) Prescription Assistance Program that can help eligible individuals to afford their medication.
es: Valley Professionals cuenta con un Programa 403 (b) asistencia con los medicamentos que pueden ayudar a las personas elegibles para pagar sus medicamentos.

source: Valley Professionals holds monthly Diabetes Support Group meetings that are completely free and open to anyone who is affected by Diabetes, even if you are not a patient with Valley Professionals. For more information visit valleyprohealth.org/diabetes
es: Valley Professionals mantiene reuniones mensuales del Grupo de Apoyo de Diabetes que son completamente libre y abierto a cualquier persona que se ve afectada por la diabetes, incluso si usted no es un paciente con Valley profesionales. Para más información visite valleyprohealth.org/diabetes

source: Visit the MSBHC for: immunizations, school physicals, well child visits, cold, fever, vomiting, congestion, sore throat, flu symptoms, cough, rash, ear ache, and similar symptoms.
es: Visita la MSBHC para: inmunizaciones, exámenes físicos, así visitas niño, frío, fiebre, vómitos, congestión, dolor de garganta, síntomas de la gripe, tos, erupción cutánea, dolor de oído, y síntomas similares.

source: Visit valleyprohealth.org to view current job openings at Valley Professionals. You can get to the site by tapping the website button on the home screen.
es: Visita valleyprohealth.org para ver ofertas de trabajo actuales en Valley profesionales. Puede llegar al sitio pulsando el botón de página web en la pantalla principal.

source: We accept all commercial insurance carriers, Medicare, and Medicaid.
es: Aceptamos todas las compañías aseguradoras comerciales, Medicare y Medicaid.

source: We have several ways to help patients that are having trouble affording their medication.
es: Tenemos varias formas de ayudar a los pacientes que están teniendo problemas para pagar su medicación.

source: What can I be seen for at the After-Hours clinic?
es: ¿Qué me pueden atender en la clínica para fuera de horario?

source: What can I do if I am unable to pay for my prescription?
es: ¿Qué puedo hacer si no puedo pagar mi receta?

source: What do I need to bring to apply for sliding fee scale?
es: ¿Qué necesito llevar para solicitar Sliding Fee Scale?

source: What do I need to bring to my first appointment?
es: ¿Qué necesito traer a mi primera cita?

source: What do I need to do for my child to be seen by the MSBHC?
es: ¿Qué necesito hacer para que mi hijo sea visto por el MSBHC?

source: What if I am unable to pay my bill?
es: ¿Qué pasa si no puedo pagar mi factura?

source: What if I have other questions about billing?
es: ¿Qué pasa si tengo otras preguntas acerca de la facturación?

source: What types of insurance do you accept?
es: ¿Qué tipos de seguros se aceptan?

source: What types of services are available on the Mobile School-Based Health Center?
es: ¿Qué tipos de servicios están disponibles en el Centro Móvil de Salud Basado en la Escuela?

source: When is After-Hours clinic?
es: Cuando es una clínica fuera de horario?

source: Who can be seen on the Mobile Health Center?
es: Quién se puede ver en el Centro de Salud Móvil?

source: Yes, Valley Professionals accepts self-pay, and also has a sliding-fee scale for eligible individuals.
es: Sí, Valley Professionals acepta la auto-pago, y también tiene una escala móvil de tarifas para las personas elegibles.

source: Yes, our Community Health Workers are specially trained to help individuals find affordable health coverage. To make an appointment, contact the Valley Professionals Community Health Center nearest you.
es: Sí, nuestra Commmunity Health Workers están especialmente entrenados para ayudar a las personas a encontrar cobertura de salud asequible. Para hacer una cita, póngase en contacto con los profesionales Valley Community Health Center más cercano.

source: Yes, you may grant permission for another person to bring your child to his or her appointment after you have completed and submitted a consent form available in the forms section of this app.
es: Sí, puede conceder permiso para que otra persona para llevar a su hijo a su nombramiento después de haber completado y enviado el formulario de consentimiento disponible en la sección de formularios de esta aplicación.

source: Yes.
es: Si.
